{"id":7704,"date":"2021-05-05T09:56:33","date_gmt":"2021-05-05T14:56:33","guid":{"rendered":"https:\/\/www.fixedopsdigital.com\/?p=7704"},"modified":"2021-05-05T09:58:19","modified_gmt":"2021-05-05T14:58:19","slug":"best-practice-award-winner","status":"publish","type":"post","link":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/","title":{"rendered":"Best Practice Award Winner"},"content":{"rendered":"[vc_row type=&#8221;full_width_background&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; bg_color=&#8221;#f4f4f4&#8243; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; top_padding=&#8221;2%&#8221; bottom_padding=&#8221;2%&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221; shape_type=&#8221;&#8221;][vc_column centered_text=&#8221;true&#8221; column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text css=&#8221;.vc_custom_1620140282115{margin-bottom: 30px !important;}&#8221;]\n<h2 style=\"text-align: center;\">Fixed Ops Roundtable #11<\/h2>\n<p style=\"text-align: center;\"><strong>The Fast and The Furious: Virtual Event<\/strong><\/p>\n[\/vc_column_text][divider line_type=&#8221;Small Line&#8221; line_alignment=&#8221;center&#8221; line_thickness=&#8221;4&#8243; divider_color=&#8221;extra-color-gradient-2&#8243; animate=&#8221;yes&#8221; custom_height=&#8221;80&#8243; custom_line_width=&#8221;100&#8243;][vc_column_text css=&#8221;.vc_custom_1620140341273{margin-bottom: 50px !important;}&#8221; max_width=&#8221;550&#8243;]\n<p style=\"text-align: center;\">At the latest Fixed Ops Roundtable event, Owen Moon, CEO of Fixed Ops Digital gave his presentation, &#8220;TODAY&#8217;S SERVICE CUSTOMER \/\/ BUILT FOR SPEED.&#8221; Check out the full presentation below&#8230;<\/p>\n[\/vc_column_text][vc_video link=&#8221;https:\/\/youtu.be\/zmP8688VWKQ&#8221; align=&#8221;center&#8221;][divider line_type=&#8221;No Line&#8221; custom_height=&#8221;15&#8243;][nectar_btn size=&#8221;large&#8221; button_style=&#8221;regular&#8221; button_color_2=&#8221;Accent-Color&#8221; icon_family=&#8221;none&#8221; url=&#8221;https:\/\/www.fixedopsdigital.com\/demo\/&#8221; text=&#8221;Get Started Today!&#8221;][divider line_type=&#8221;No Line&#8221; custom_height=&#8221;15&#8243;][\/vc_column][\/vc_row][vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]\n<h3>Presentation Transcript:<\/h3>\n<p>Owen Moon, &#8220;Thank you, Ted, it is great to be here today guys! As Ted said I am the CEO of Fixed Ops Digital. We are the automotive industry&#8217;s premier service marketing &amp; technology company. We currently work with dealerships all over the country. Not only helping them with some of the execution but also the strategies that the dealerships do to help drive more fixed ops revenue, not only from the service side but also parts, tires, collision, and accessories. As we all know there is a lot of opportunity inside the fixed ops department that we need to focus on. My session today is, TODAY&#8217;S SERVICE CUSTOMER \/\/ BUILT FOR SPEED.<\/p>\n<h3>Who Is Today’s Service Customer?<\/h3>\n<p>Let&#8217;s talk a little bit about who is today&#8217;s service customer? The thing about service customers for a while now is that they are different consumers. I am going to focus on three more popular customers that we see every day.<\/p>\n<ol>\n<li>A customer that has an immediate issue or need<\/li>\n<li>Regular maintenance customer<\/li>\n<li>The customer that needs those larger repairs or recalls<\/li>\n<\/ol>\n<p>Let&#8217;s dive in deeper into who these customers are:<\/p>\n<ul>\n<li>\n<h4>Immediate Issue or Need Customer<\/h4>\n<ul>\n<li>Their situation has recently changed (ex. they were driving down the road and noticed that their brakes started to squeak or grind)<\/li>\n<li>Popular services include: brakes, tires, batteries, transmission<\/li>\n<\/ul>\n<\/li>\n<li>\n<h4>Regular Maintenance Customer<\/h4>\n<ul>\n<li>Your bread and butter &#8211; this is the customer that works off the mileage and time interval recommendations from the OEM<\/li>\n<li>They have usually scheduled appointments and are the ones you fill your calendar with every day<\/li>\n<li>These can also be express customers or walk-ins too<\/li>\n<\/ul>\n<\/li>\n<li>\n<h4>Larger Repairs &amp; Recall Customers<\/h4>\n<ul>\n<li>Typically these services are the higher-dollar ROs and bring the higher profit margins<\/li>\n<li>These repairs need specialized equipment that your dealership has, where an independent dealer wouldn’t be able to handle it<\/li>\n<li>Services can take several days to complete, which brings in factors such as loaner vehicles<\/li>\n<li>You can be caught waiting on parts and having to make decisions about how to service that customer in the meantime<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>When you look at these three buckets of customers, you really want to take it from a marketing standpoint. How do you market, advertise, and communicate to these three different buckets because they are different customers? When you’re looking at a good marketing strategy, especially from a digital standpoint, you want to make sure that you have a strategy or a focus to accommodate all of the different kinds of customers that you’re bringing in.<\/p>\n<h3>Marketing to Today’s Service Customers<\/h3>\n<p>The first thing that I do know, no matter what type of customer is coming into your service center today, is that they are smarter than they’ve ever been and they want to be informed.<\/p>\n<p>What do I mean by that? Well, when you’re looking at it from a marketing standpoint, getting the information to the customers is more important than ever. One of the things that we always talk about is <strong>promoting the most popular services on your website<\/strong>. Long gone are the days of just picking out a couple of services and focusing on those in a 30-day timeframe. We always talk about putting in a more integrated and robust approach to get the services out there that you guys offer. When customers are starting to look, especially those new customers that might not have a relationship with your dealership, if they’re coming to your store or going online to look, they want to find your dealership, and when they do find your dealership they want to know what services you offer\/ if you offer the service that they need.<\/p>\n<p>The other thing we always talk about is <strong>having clear and transparent pricing<\/strong>. A lot of dealerships are moving away from $10 off and 10% off coupons. The reason why is that when you look at the competition and somebody has an alignment service for $89.95 and somebody else has an alignment service for $10 off, more than likely, a customer is going to gravitate towards that price integrity and transparency offer. This is because no one knows what $10 off or 10% off means. Who knows if they raised the price $10 just to lower it $10 with the coupon? So, having that clear and transparent pricing is more important and it’s what we strive for when we talk to our customers.<\/p>\n<p>The third thing with why the customers want to be informed is they want to have the education. We talk about the “why” and “when” &#8211; <strong>why do you need this service and when do you need this service?<\/strong> If we can get some of that information out on your website before the customer books the appointment, it can go a long way in not only getting bigger ROs and using that as a way to educate customers both online and on the lot, but it’s also a great way for you to really educate that customer before you even have a conversation with them.<\/p>\n<h3>Online Car Buying Funnel &#8211; Online Service Funnel<\/h3>\n<p>I talk about this a lot because we’ve done a really good job on the sales side. For years, we’ve created this online car buying funnel. When we looked at a dealership&#8217;s website, that scenario didn’t really exist. So, what we did is we created what we call our “online service funnel”. It&#8217;s designed the same way that you find from the sales side because we’ve seen it work so well and everyone’s adapted it, from Cars.com to our gurus to all of the third-party listing sites as well as all the dealership sites &#8211; they all use that same funnel. So we call ours the “SMP &#8211; SDP &#8211; Appointment” funnel. Let me tell you a little bit about what that means.<\/p>\n<p>So the SMP is what we call our Service Menu Page. Again, it’s showcasing more of a menu-style pricing, and that comes with a strategy. It’s not something that we just plug and play where we just sign somebody up, flip a switch and all the services show up and you just forget about it and move on. This is where we’re talking to our customers monthly about different services that we want to highlight. We always start at the service menu page and we make sure that we’re showcasing more services that our dealership offers. Then, we always create that nice online service funnel where if somebody wants to get more information about a particular service (in this case you can see a brake fluid exchange), to go in and be able to get more information about that brake fluid exchange from our Service Detail Page. This has information like:<\/p>\n<ul>\n<li>What exactly does the service cover?<\/li>\n<li>Why is it important?<\/li>\n<li>Why should you get that service done with this dealership?<\/li>\n<\/ul>\n<p>So we not only highlight the service, but <strong>we also highlight the dealership<\/strong> and make them the authority when it comes to getting that service done.<\/p>\n<p>And then, of course, we want to make sure that everything matches in pricing and that we have those Call to Actions to really bring that customer down the funnel and get them to the appointment.<\/p>\n<h3>Today’s Service Customers are Mobile First<\/h3>\n<p>The next thing I want to talk about is how today’s customers are mobile-first. Most of the traffic we see every day shows us that customers that are going to the dealership’s website are mobile. I mentioned this on the <a href=\"https:\/\/www.fixedopsdigital.com\/fixed-ops-roundtable-jungle\/\">last roundtable<\/a> but we really focus on integrity and having good data behind this. We utilize the dealership’s google analytics accounts because what we find is that when you have your own data, it&#8217;s not necessarily wrong, it just might not be as accurate as what you can get from google analytics.<\/p>\n<p>I also want to talk about mobile-first customers. I had my analytics and reporting teams pull a sampling of about 30 dealerships. We ran a report that showed us that in those 30 stores, 68.21% of all website traffic for the service side of the business was mobile. So you have to think mobile-first and <strong>you have to have a mobile-friendly website experience for your service customers<\/strong>. It’s more important than ever and it’s something we look at every day &#8211; we strive to be better and find out how we can make the experience even better for the service customers that come to our dealership’s websites.<\/p>\n<p>We also want to focus on <strong>conversions that matter<\/strong>. When it comes down to it, the service customer has a need today and they are looking for an answer today. I don’t know a lot of service customers today that are focusing on the long-term to get on text lists or email lists or things like that because it’s just not as important to them. I’ll tell you right now, nobody’s getting up today and going “who’s going to fix my alignment in 6 months” or “who’s going to fix my transmission in 6 months when it goes out”. It’s just not feasible. We are a needs industry where if I have a problem today, I need it solved today, and I&#8217;m going to look for that solution. That’s where we’re focusing a lot of our efforts is to get the conversions that matter to the dealerships (the ones that generate the revenue).<\/p>\n<h3>Dealer Wallet for a Mobile Customer<\/h3>\n<p>With all the mobile business going on, printing coupons is dead. I’ve seen some reporting lately that showed that 50, 60, or 70% of all conversions are print coupons. <strong>If 70% of your traffic is mobile and yet 70% of your conversions are “print coupon”, something’s wrong there.<\/strong><\/p>\n<p>One of the products that we have is called Dealer Wallet. It’s a way for a customer to use their mobile device to actually save coupons into their phones. There&#8217;s really good data out there that says because most of the customers are mobile, that’s also where they’re saving things &#8211; they’re saving airline tickets, NFL tickets, concert tickets, and more like that. They’re already using this feature, and even from a desktop to a mobile scenario, we use a QR code. A QR code has become a lot more popular because as you go to restaurants and bars, they don’t have paper menus anymore &#8211; they’re using QR codes to bring up menus. So people are getting more comfortable using this type of technology. With a lot of the smartphones having Apple Wallet and the Android pass systems already downloaded in them, it’s just becoming a lot easier and a lot more adaptable for today’s service customer.<\/p>\n<p>Part of that research that we did when we looked at the mobile traffic was we also looked at the specials page, or what we call our Service Menu Page, and we ran a report on those same 30 dealerships. <strong>We found that about 58.66% of the time if somebody went to our specials page, they actually then migrated or clicked into the schedule service page.<\/strong> That tells us that people are ready to take action &#8211; they come to the website, we give them all the information that they’re looking for, we have clear and transparent pricing, we educate them, and now they&#8217;re ready to take action and to schedule service with your dealership today.<\/p>\n<h3>Make Service Scheduling Easy<\/h3>\n<p>So, make sure that your online scheduler is easy to use. I have a challenge for you &#8211; have you gone out and tried to use your online scheduler on your mobile device? If you haven&#8217;t, GO DO IT. Tell me if it’s easy, or if a <em>customer<\/em> would think it’s easy because let&#8217;s be honest, we’re all in the business and we understand how to use the software &#8211; customers, not so much. So go do that if you haven’t.<\/p>\n<p>Make sure you have price integrity, too. We are an Xtime preferred agency partner and one of the things we do for our clients is if you’re using Xtime for example (which a lot of dealerships still do), make sure there is price integrity. If you have an oil change for $49.95 but then you go into Xtime and that oil change is now $59.95, that’s a disconnect with the customer. In fact, we’ve seen in some cases up to a 60% abandonment rate as far as when customers start that online scheduler and if they actually finish it. A lot of it has to do with some of the things I’m talking about, <strong>just making sure that everything matches, that the customer feels comfortable, and that you have your scheduler optimized for easy use.<\/strong><\/p>\n<p>The last thing is <strong>don’t give the consumer too many options<\/strong>. We don’t need a ton of conversion points for the service customer. That service customer either has a need, is coming in for regular maintenance, or has a larger repair\/recall. All they want to do is get an appointment, talk to somebody and let them know what’s going on, and see what it’s gonna take to get that fixed.”<\/p>\n[\/vc_column_text][divider line_type=&#8221;No Line&#8221; custom_height=&#8221;15&#8243;][nectar_btn size=&#8221;large&#8221; button_style=&#8221;regular&#8221; button_color_2=&#8221;Accent-Color&#8221; icon_family=&#8221;none&#8221; url=&#8221;https:\/\/www.fixedopsdigital.com\/demo\/&#8221; text=&#8221;Get Started Today!&#8221;][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;full_width_background&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; bg_color=&#8221;#f4f4f4&#8243; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; top_padding=&#8221;2%&#8221; bottom_padding=&#8221;2%&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221; shape_type=&#8221;&#8221;][vc_column centered_text=&#8221;true&#8221; column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221;&#8230;<\/p>\n","protected":false},"author":3,"featured_media":7711,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[279],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Best Practice Award Winner - Fixed Ops Digital<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Fixed Ops Digital \/\/ Best Practice Award Session with Owen Moon\" \/>\n<meta property=\"og:description\" content=\"Fixed Ops Digital CEO Owen Moon discusses best practice for reaching your different service customers through our Online Service Funnel - SMP - SDP - Appointment.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/\" \/>\n<meta property=\"og:site_name\" content=\"Fixed Ops Digital\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/fixedopsdigital\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-05T14:56:33+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-05T14:58:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"523\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Fixed Ops Digital \/\/ Best Practice Award Session with Owen Moon\" \/>\n<meta name=\"twitter:description\" content=\"Fixed Ops Digital CEO Owen Moon discusses best practice for reaching your different service customers through our Online Service Funnel - SMP - SDP - Appointment.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Julie Branum\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\",\"name\":\"Fixed Ops Digital\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/fixedopsdigital\/\",\"https:\/\/www.instagram.com\/fixedops\/\",\"https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"width\":750,\"height\":200,\"caption\":\"Fixed Ops Digital\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"name\":\"Fixed Ops Digital Marketing\",\"description\":\"Automotive Fixed Ops Marketing\",\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg\",\"width\":1000,\"height\":523},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage\",\"url\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/\",\"name\":\"Best Practice Award Winner - Fixed Ops Digital\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage\"},\"datePublished\":\"2021-05-05T14:56:33+00:00\",\"dateModified\":\"2021-05-05T14:58:19+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.fixedopsdigital.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Best Practice Award Winner\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage\"},\"author\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\"},\"headline\":\"Best Practice Award Winner\",\"datePublished\":\"2021-05-05T14:56:33+00:00\",\"dateModified\":\"2021-05-05T14:58:19+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage\"},\"wordCount\":2581,\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/FOD-2021-BestPractices-FEATURE.jpg\",\"articleSection\":[\"Awards\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\",\"name\":\"Julie Branum\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"caption\":\"Julie Branum\"},\"description\":\"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.\",\"url\":\"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Best Practice Award Winner - Fixed Ops Digital","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/","og_locale":"en_US","og_type":"article","og_title":"Fixed Ops Digital \/\/ Best Practice Award Session with Owen Moon","og_description":"Fixed Ops Digital CEO Owen Moon discusses best practice for reaching your different service customers through our Online Service Funnel - SMP - SDP - Appointment.","og_url":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/","og_site_name":"Fixed Ops Digital","article_publisher":"https:\/\/www.facebook.com\/fixedopsdigital\/","article_published_time":"2021-05-05T14:56:33+00:00","article_modified_time":"2021-05-05T14:58:19+00:00","og_image":[{"width":1000,"height":523,"url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_title":"Fixed Ops Digital \/\/ Best Practice Award Session with Owen Moon","twitter_description":"Fixed Ops Digital CEO Owen Moon discusses best practice for reaching your different service customers through our Online Service Funnel - SMP - SDP - Appointment.","twitter_image":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg","twitter_misc":{"Written by":"Julie Branum","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/www.fixedopsdigital.com\/#organization","name":"Fixed Ops Digital","url":"https:\/\/www.fixedopsdigital.com\/","sameAs":["https:\/\/www.facebook.com\/fixedopsdigital\/","https:\/\/www.instagram.com\/fixedops\/","https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/"],"logo":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#logo","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","width":750,"height":200,"caption":"Fixed Ops Digital"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/www.fixedopsdigital.com\/#website","url":"https:\/\/www.fixedopsdigital.com\/","name":"Fixed Ops Digital Marketing","description":"Automotive Fixed Ops Marketing","publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/large-FOD-2021-FORT-BestPracticeAward-SOCIAL.jpeg","width":1000,"height":523},{"@type":"WebPage","@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage","url":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/","name":"Best Practice Award Winner - Fixed Ops Digital","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage"},"datePublished":"2021-05-05T14:56:33+00:00","dateModified":"2021-05-05T14:58:19+00:00","breadcrumb":{"@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.fixedopsdigital.com\/"},{"@type":"ListItem","position":2,"name":"Best Practice Award Winner"}]},{"@type":"Article","@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#article","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage"},"author":{"@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941"},"headline":"Best Practice Award Winner","datePublished":"2021-05-05T14:56:33+00:00","dateModified":"2021-05-05T14:58:19+00:00","mainEntityOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#webpage"},"wordCount":2581,"publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/best-practice-award-winner\/#primaryimage"},"thumbnailUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/05\/FOD-2021-BestPractices-FEATURE.jpg","articleSection":["Awards"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941","name":"Julie Branum","image":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","caption":"Julie Branum"},"description":"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.","url":"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/"}]}},"_links":{"self":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7704"}],"collection":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/comments?post=7704"}],"version-history":[{"count":0,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7704\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media\/7711"}],"wp:attachment":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media?parent=7704"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/categories?post=7704"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/tags?post=7704"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}