{"id":7812,"date":"2021-07-08T16:44:07","date_gmt":"2021-07-08T21:44:07","guid":{"rendered":"https:\/\/www.fixedopsdigital.com\/?p=7812"},"modified":"2021-07-09T11:29:53","modified_gmt":"2021-07-09T16:29:53","slug":"marketing-technology-panel","status":"publish","type":"post","link":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/","title":{"rendered":"Marketing &#038; Technology Panel"},"content":{"rendered":"[vc_row type=&#8221;full_width_background&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;none&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; bg_color=&#8221;#00a79d&#8221; scene_position=&#8221;center&#8221; top_padding=&#8221;10&#8243; bottom_padding=&#8221;10&#8243; constrain_group_2=&#8221;yes&#8221; top_padding_tablet=&#8221;20%&#8221; left_padding_tablet=&#8221;10%&#8221; constrain_group_4=&#8221;yes&#8221; right_padding_tablet=&#8221;10%&#8221; left_padding_phone=&#8221;0&#8243; constrain_group_6=&#8221;yes&#8221; right_padding_phone=&#8221;0&#8243; text_color=&#8221;light&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221; shape_type=&#8221;straight_section&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;0px&#8221; centered_text=&#8221;true&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_row_inner column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; bottom_padding_tablet=&#8221;10&#8243; text_align=&#8221;left&#8221;][vc_column_inner column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; enable_animation=&#8221;true&#8221; animation=&#8221;fade-in-from-bottom&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_column_text]\n<h6>Learn From The Best<\/h6>\n[\/vc_column_text][\/vc_column_inner][\/vc_row_inner][split_line_heading animation_type=&#8221;line-reveal-by-space&#8221; font_style=&#8221;p&#8221; stagger_animation=&#8221;true&#8221; content_alignment=&#8221;default&#8221; mobile_content_alignment=&#8221;inherit&#8221; text_content=&#8221;Owen Moon, William Demaree, Shon Kingrey, Anne Lister &amp; Brad Paschal&#8221;][\/split_line_heading][image_with_animation image_url=&#8221;7813&#8243; animation=&#8221;Fade In&#8221; hover_animation=&#8221;none&#8221; alignment=&#8221;&#8221; border_radius=&#8221;none&#8221; box_shadow=&#8221;none&#8221; image_loading=&#8221;default&#8221; max_width=&#8221;100%&#8221; max_width_mobile=&#8221;default&#8221;][\/vc_column][\/vc_row][vc_row type=&#8221;full_width_background&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;none&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; top_padding_tablet=&#8221;7%&#8221; bottom_padding_tablet=&#8221;10%&#8221; text_color=&#8221;custom&#8221; custom_text_color=&#8221;#d4c0ff&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; id=&#8221;impact&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; enable_shape_divider=&#8221;true&#8221; shape_divider_color=&#8221;#ffffff&#8221; shape_divider_position=&#8221;bottom&#8221; shape_divider_height=&#8221;50%&#8221; bg_image_animation=&#8221;none&#8221; shape_type=&#8221;straight_section&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_video link=&#8221;https:\/\/youtu.be\/g9QlVsCIRPY&#8221; align=&#8221;center&#8221;][divider line_type=&#8221;No Line&#8221; custom_height=&#8221;15&#8243;][vc_column_text]\n<h4 class=\"p1\"><span style=\"color: #000000;\">Gene Girdley:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Welcome back to The Matrix. And Ted, our good friend Owen Moon is back this time with a tremendous panel of marketing and technology experts.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Ted Ings:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Gene, we&#8217;re so used to seeing Owen do these segments all on his own, but Owen you, and I thought about bringing in some experts, and I want to introduce everybody first, starting with Owen Moon, who is the CEO of Fixed Ops Digital. Owen, welcome back to The Fixed Ops Roundtable, of course.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, thanks for having me, Ted. I&#8217;m super excited today. Like you said, I&#8217;m normally putting together my own session to talk a little bit about marketing and technology, but I thought a better plan today would be to bring in some great professionals and experts in our space, that could maybe give us a little more insight from inside the service drive. So, I have today some great friends and people in the business that I work with, in a lot of cases. First off, I have Bill Demaree. He is the Fixed Ops Director at Tom Wood Automotive Group in Indianapolis and amongst other places. I have Shon Kingrey. Shon is the Fixed Ops Director for Step One Automotive. I have Anne Lister, from Williams Honda in upstate New York. And I have Brad Paschal, who is actually our regional sales director for the South region with Fixed Ops Digital. So, guys and gals, thank you for joining me today.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Brad Paschal:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Thank you, Owen.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, perfect. Alright, cool. Well, as Fixed Ops Digital, we kind of pride ourselves as being the premier service marketing and technology company in the automotive industry, and I thought it would be really good to maybe bring you guys on and talk a little bit about marketing and technology, but less from the vendor side and more from your guy’s side. Which obviously, you&#8217;re in the trenches every day working with your dealerships, working with your staff. And so, what I want to start with first and I&#8217;d love to hear some great feedback starting with Bill is&#8230; is there any technology that you guys are using today that maybe you weren&#8217;t using five or even 10 years ago inside your departments? Obviously, as technology continues to change and as things are always evolving, I&#8217;m always interested to see what type of technology that you guys have embraced at your dealerships or with your organizations to help you move forward as a company. So, Bill, why don&#8217;t you start and then what can open the discussion?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">William Demaree:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, that&#8217;s a great question Owen, and unfortunately, you can&#8217;t even go back 5, 10 years ago, you can go just a few months ago, as fast as the technology is changing in this industry. As a group, we&#8217;ve started a transition a few years back and we&#8217;ve gotten really aggressive with it when COVID happened, about touch-less point contact. We&#8217;re doing some email testing on all of our inspection systems, that a guest will be able to click on their cell phone and approve or decline the repairs in seconds, not hours. So, it really eliminates the phone calls from our service consultants, going over an inspection process that we can now&#8230; we email that and text that out. So, it makes it really virtual and we find that the approval rating is up substantially from a percentage of approval, but that it&#8217;s really closing the gap on the timeline of the approvals that happen on a phone call. So, our technology has really helped us increase our closing ratio on all additional sales requests by over 5% just in the last four months. A 5% on a $5 million worth of ask is a lot of money. So, we know that our closing ratios are going up, our sales are going up and that&#8217;s all because of the virtual stuff that we&#8217;re doing based on texting and emailing estimates.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, great points. Anytime you can shorten that sales cycle, make it easier, that type of thing. Shon, is anything you&#8217;re doing from inside the lane or inside the drive that is helping you from a technology standpoint?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Shon Kingrey:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, I&#8217;ll feed off what Bill said as well. I&#8217;ll start with the iPads on the service drive. With our 17 car lines, 5 of our stores are FCA stores, or Stellantis stores now. And we took that platform of FCA, of Y Advisor 3.0, that we&#8217;ve launched that in all of our franchises, and imports and domestic alike. It&#8217;s working very, very well for us. The upsells on the service drive because the client is in the car or potted with the car, everything is there, the client doesn&#8217;t have to set foot on the service drive. And to Bill&#8217;s point, we live in the panhandle of Florida where the COVID kind of never happened.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">You never wore masks?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Shon Kingrey:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">No, we didn&#8217;t want masks or anything. But here again, the client is with the vehicle, the walk-around has to happen. You can&#8217;t skip that step; it has to go. And to also take off of Bill&#8217;s point, the texting option. And then there&#8217;s various obvious options and vendors out there. The texting is huge for us. It&#8217;s such a big part and it&#8217;s part of the reason our CSI, it&#8217;s a big part of a reason our CSI is improved the way it has is because the communications there, where the client sees that, Owen Moon&#8230; &#8220;Hey, this is Owen thank you for bringing your vehicle in for service.&#8221; Listen, Owen didn&#8217;t send that, the system sent it, but it&#8217;s a source of communication. And the inbound phone calls are down, we have a monster in-house service BDC and our inbound phone percentages went down almost 40% because the communication is going through text and not through phones.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, and to your point, texting, it&#8217;s got to be a two-way communication, right? It can&#8217;t be one-way communication. I see a lot of things out there where it&#8217;s just texting a piece of information to a client, and there&#8217;s no way to really have that client respond. I feel like there&#8217;s a lost opportunity there when that happens. So, definitely making it more two-way engagement, two-way communication, and texting is a great way to get there. So, good point, Shon. Anne, What are your thoughts? I mean, obviously being at a Honda store, some of the brands I would say are a lot more adept to technology and that type of thing. I think Honda&#8217;s maybe one of those brands. Are you seeing a difference inside your departments or inside your dealership when it comes to technology?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Anne Lister: <span class=\"Apple-converted-space\"> <\/span><\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah. Like Bill and Shon both said, the texting app is key. And to take it one step further, we can also do videos and pictures to shoot right to the customers because that just kind of solidifies that relationship, it makes it personal, this is my vehicle, it builds the trust value. And a lot of times when you&#8217;re at work you can&#8217;t take a phone call, but you can certainly answer a text message. So, it really cuts down that time of waiting for approval and also, it leaves you a paper trail. So, you text what the part is, what the estimate is, you get their approval. So, there&#8217;s no miscommunication which is huge between the advisor and the customer because everything is right there in writing. So, it takes a lot of that gray area out of play.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, and all that helps with reviews, CSI rating, all the things that you guys are scorecards on from an OEM level. I feel like that&#8217;s the frustration. If we don&#8217;t have a good process or good technology that we can use to help that, that&#8217;s how we get those bad ratings and CSI reviews, and that&#8217;s easily fixed. So, Brad, real quick, before I move on in this question. From an agency side, from kind of a vendor side, what are you seeing from a technology standpoint maybe that&#8217;s out there now, that wasn&#8217;t out there 5 or even 10 years ago, or to Bill&#8217;s point a few months ago?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Brad Paschal:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">I think one of the things&#8230; all of these technologies have something in common. They promote transparency. Each one of those promotes transparency in the service department, and we saw a wave come through the sales department where everything was about transparency. You see companies like True Car who built their whole platform on transparency. And so. that&#8217;s starting to happen on the service side, you&#8217;re starting to see competitors like Speedy Oil Changes put cameras in each Quick Lube Bay, so you can watch your car to get work on. There&#8217;s a reason why Owen and I go to Krispy Kreme, and we&#8217;re sitting in line, and it&#8217;s out the door and we don&#8217;t get mad because we can watch the little donut go up on the conveyor belt, and come down and go out the other side. So, there&#8217;s a reason why Domino&#8217;s gained a lot of market share when they came out with the app where you could track the progress of your pizza. So, you can track the progress of a $12.99 pizza, but we don&#8217;t yet be able to track how our cars doing in the service department. So, I think that that&#8217;s as you&#8217;re looking for things in this space, the most important thing to say is, does this add transparency to my store? Does it complement the process that I have? Does it provide that customer service? Remember, the first time you went into a store, a lot of us don&#8217;t know all of the services that we have, we don&#8217;t know all of the pricing for everything, we don&#8217;t understand, we&#8217;re not technicians, so just keep that in mind when you&#8217;re going through those technologies. We need to have those services that we knew, we need to have that transparent pricing, and really take a look at the things that you have now and apply that to it.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">William Demaree:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Owen, just real quick, the other thing that we found was most important is how many technicians now trust the system, how many technicians over the years, so that service advisor can&#8217;t sell anything, I&#8217;m not even going to recommend it. Now that we&#8217;re sending out via text and email, they know it&#8217;s hitting the inspection and they know we can now track whether that actually went to the guest or not. So, the transparency, what Brad was just speaking about, the technician now see and feel that so they&#8217;re more comfortable and making those recommendations in our stores.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Brad Paschal:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">And so, that&#8217;s internal too, so that transparency goes multiple ways. So, as a vendor, you guys have been under the microscope with transparency from consumers, and then we get it on the vendor side. So, that has to go with whoever you&#8217;re partnering with, should explain how that&#8217;s transparency works in the stores too, and how it can help with that. I think that&#8217;s really an important point, Bill.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Good points, Brad. Great points everybody. So, quick-moving on, I just wanted to talk a little bit about mobile service. I&#8217;ve been seeing more and more of this out on LinkedIn and just as I&#8217;m having conversations with Fixed Ops departments, as they&#8217;re starting to dabble in this. Are any of you, and I&#8217;ll start with Shawn and then just move along&#8230; is anybody using the mobile service side of things<b> <\/b>like general maintenance, oil changes, tire rotations, maybe tire replacements? Obviously, you&#8217;re not doing a lot of big repairs in someone&#8217;s driveway, but for someone that&#8217;s maybe at work or someone that&#8217;s sitting at their house, have any of you started to embrace that to kind include that with the overall customer experience? Shawn, we&#8217;ll start with you.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Shon Kingrey:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Sure, it&#8217;s good timing too because one of our main two, three, objectives was mobile service, and everybody knows ED, and we&#8217;ve kind of mirrored some of Ed&#8217;s. We&#8217;re jumping so much in it, we&#8217;re putting seven vehicles in Q3 just on the road, strictly for that. And yes, obviously, and we can talk about what<b> <\/b>Brad had talked about at one time with me VIP subscription services, and we&#8217;re working on that and concierge service. And we have a pay for service that we launched on June 1st, that&#8217;s working very, very well. Part of that was the mobile service, but a bigger piece of it was about capacity. The shops are full, I don&#8217;t have any more bays at this point. And where I&#8217;m at, it&#8217;s really not how much you pay, it&#8217;s how much time you get off because everybody wants to go to the beach. And if you talk about a second shift or third shift, it&#8217;s like you have a third eye, but the capacity issue that is relieved for the express getting away off the service drive is hands down&#8230; and what&#8217;s funny is, we&#8217;re rolling it out, and two of our seven vehicles are on the road now. The clients are prepaying, there&#8217;s no money exchanged. It&#8217;s seamless. It&#8217;s literally probably one of the best ideas we&#8217;ve had in a long time.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, anybody else? That&#8217;s a great point. Anybody else has anything they want to add? I was gonna mention something about doing two shifts because I know that&#8217;s also been discussed maybe as an alternative. So, Anne what are you guys doing over there up in the northeast.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Anne Lister: <span class=\"Apple-converted-space\"> <\/span><\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">So, we offer free pickup and delivery of your vehicle. I love the whole mobile concept, but this is a direct&#8230; what we can offer without having the huge expense of the mobile trucks. So, we have a couple of big hospitals near us, we have a couple of big factories, so what we have found, and especially during the pandemic, people have been accustomed to having everything delivered to their house and so, most importantly, to somebody really is their time. So, if you&#8217;re at work 8 to 10 hours, we can get your car, we service it, going back to the texting app, we send a secure link, you can pay for it so it&#8217;s touch-less contact, We bring your car back before we were even out of work so your day is not interrupted. You get out of work, you can go to the grocery store, you can go to your kid&#8217;s events, you can do whatever you want and your car&#8217;s already serviced. So that has really taken off. Again, I really believe that this pandemic has taught us to be a little spoiled. I always talk about door dash, people don&#8217;t care, they&#8217;ll pay $20 to have a cheeseburger delivered to their front door, and they don&#8217;t care, they pay it too because of the convenience. So, we offer this service free and it&#8217;s convenient for our customers. So, that&#8217;s taken off very well.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, great points. Unfortunately, with DoorDash, it makes it a little too convenient for my kids these days, but I hear what you&#8217;re saying. Well, anything on your end that you&#8217;re seeing from a mobile service standpoint?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">William Demaree:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, unfortunately, we&#8217;ll have the problem that Shon does, everyone wants to go to a beach. We&#8217;re in Indiana and we don&#8217;t have beaches, no Indiana beach yet, but stay tuned. We are getting into mobile service. We&#8217;re just a few months away from launching a mobile service with our company, we&#8217;re just not quite there yet. Same as Anne, we do a lot of pickup and delivery at some of our Highline stores. Our store in Minnesota, our Honda store, or Lexus store in Indianapolis does a lot of pickup and delivery service, but we&#8217;ve not been able to tap into the mobile service from a profitability standpoint but we think we have it figured out and you&#8217;ll see us on LinkedIn soon with a whole new product in probably 60 days.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Awesome, I&#8217;m looking forward to that because you guys are always on the front end of stuff, so that&#8217;s awesome. Brad, why don’t you finish us up on this, anything in your thoughts from a marketing standpoint on how to maybe get some of that information out there a little clearer for customers?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Brad Paschal:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, I think this is interesting. So, this is a cool topic because it&#8217;s the same thing we talked about on the transparency side, on the sell side of stuff we were forced to serve as customers for on the sells side whichever way they want to be serviced. Whether it&#8217;s mobile, whether it&#8217;s pickup and delivery, whether it&#8217;s a late-night drop-off, early-bird pickup, there&#8217;s a lot of different ways that you can service people. It&#8217;s kind of silly to me&#8230; I live in Texas, so I&#8217;m going to do some redneck stuff. So, you can go out there and there&#8217;s a farrier that will come out there and shoe your horses, you don&#8217;t have to take it to the farrier. So, why do you have to bring your car into the service department? There are a couple of different things that are going to be interesting that I think you&#8217;re going to be big conversations out there. The first thing is the mobile service and how that&#8217;s going to work. But the problem right now is a lot of people are having trouble getting technicians. That&#8217;s a big, big thing that&#8217;s going on. So, that&#8217;s something that is going to be a big, big conversation about hiring technicians. And the second part of it that&#8217;s going to be huge&#8230; I&#8217;m interested to see how OEMs are going to react, is standalone service centers. So, with Google My Business being so important right now, and with proximity being the major ranking factor when people are searching, a lot of big dealer groups are looking at putting service centers on different parts of the city to have standalone quick lube, and service centers and stuff like that. So, I think those things are going to be some solutions to the problems that come up. I think those are going to be some really interesting things that are going to come out there, but it&#8217;s just you have to make sure that whatever process that you go with, or whatever solution fits your market. A mobile standalone service center might not make sense where Brian Benstock is in the middle of New York City, but out here in Texas where you have a bunch of land, and you can buy land pretty cheap, and you can put one over there, that might make a lot of sense. So, I think it just has to match whatever the experience is in the store, and that&#8217;s the most important thing when you&#8217;re doing that. And just educating those customers of what that process looks like, that&#8217;s super important, and then creating a brand umbrella. So, branding that thing separately, but it&#8217;s still under the umbrella of the brand there locally is super important too.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, great points everybody. I&#8217;ll end with technology before we move into marketing, is that technology is great as long as you&#8217;re using it right. And the thing I always say is that, take the pieces of the technology that sets you apart and let&#8217;s turn those into our kind of our why service message. If you have mobile service, if you have pickup and delivery,<span class=\"Apple-converted-space\">  <\/span>one of the things that we did I fixed up digital when COVID came out was in about five days, we built 500 pickup and delivery pages for our clients. It was quick because it was one of those things where&#8230; in different COVID pages, not just picking delivery, but different COVID pages because we had to get that information out there quick. And so, using your websites to push the technology that you&#8217;ve embraced as a department, I think can bring it all together for that customer experience. So, great points. So, let&#8217;s move on then let&#8217;s talk a little bit as we kind of end up here, I got one more real big topic I want to talk about and that&#8217;s from a marketing standpoint and really, kind of the same thing. Is there anything that you&#8217;re doing today that you maybe you weren&#8217;t doing 2 years ago, 5 years ago, 10 years ago, that&#8217;s really different, that&#8217;s setting yourself apart and that&#8217;s utilizing some of the things that are out there? Because obviously, our industry is always evolving, technology is always evolving, but I think marketing is also evolving. So, Anne, why don&#8217;t you start with that and tell me a little bit about maybe what you guys are doing from a marketing standpoint that you&#8217;re doing today that maybe you weren&#8217;t doing before?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Anne Lister: <span class=\"Apple-converted-space\"> <\/span><\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">So, what we are trying to do is utilize social media more. So, a lot of people like short live little commercials so to say, so under William’s Honda page, we try to do even a 30-second little skit. So, the more we can say in front of people, so we&#8217;re utilizing all of those platforms just to kind of build up our customer base and we try to be consistent because then people start to look for it. So, say every day at 3 o&#8217;clock because that&#8217;s when the most traffic hits your website. So, every day at three o&#8217;clock we do a little 30 seconds, 10 seconds, little &#8220;Hey, I&#8217;m Annie, you know, come on in,&#8221; whatever we do. But people have told me that they start to look for that every day at three o&#8217;clock because they know it&#8217;s coming. So, just little things, using the social media platforms and digital marketing, obviously is huge. But there&#8217;s so much technology out there and a lot of that stuff, again, is free with social media. So, just constantly changing it up and staying fresh in front of people.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Great points. And it&#8217;s funny to say that because as an advertising professional, I have been doing this for over 20 years, it used to be it had to be the soul polish, you had to be a professional. And I&#8217;d hear stories about TV stations doing commercials and they were they looked real third class and that type of thing. It&#8217;s really changed now, everything organic. It&#8217;s all about organic, it&#8217;s all about you want people to screw up you want people to be more natural.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Anne Lister: <span class=\"Apple-converted-space\"> <\/span><\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Exactly, I’ll be walking, and they&#8217;ll be like, &#8220;Hey, Anne,&#8221; and they got the camera on me. So, you make it fun, people enjoy that and you&#8217;ll catch their attention. You want to catch their attention because you have about 5 seconds to catch their attention.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Absolutely.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Anne Lister: <span class=\"Apple-converted-space\"> <\/span><\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">I totally wing everything.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Great points. Bill, what are your thoughts on some marketing that maybe you guys are doing?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">William Demaree:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, again, talking about how things have shifted, one thing I like to really look and talk about is fixed operations has a seat at the table finally. How many years of our websites we&#8217;re talking about variable, we&#8217;re talking about selling cars, and that&#8217;s great, we need to sell cars but we also need fixed operations front and center on the websites and we finally have made it to the big leagues. We finally have made a spot on the website, and we sit in the marketing meetings, and we&#8217;re a big part of it. So, we have switched over the last couple of years aggressively to a company that happens to be scrolling across the bottom has done a really good job for us of driving traffic to our websites, and it&#8217;s helping by the way. This company builds out our coupons, I no longer have to worry about are my store&#8217;s coupons expired? I don&#8217;t have to worry about what kind of coupon is invaluable that&#8217;s on there because that company helps us build it up for the year. So, I can look at all the stores and see exactly what&#8217;s coming, and it&#8217;s tracked because we&#8217;re driving traffic to that site. And by driving it to the site, it&#8217;s picking up the coupons, the stores, and they&#8217;re coming in, we can see it, we can feel it and we really like being a big part of the website finally.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, as you said when we were going over this, you&#8217;re finally in the show and I love that that that analogy. And now, just kind of just preface that, there is a certain way to do it that actually gets the results with the search engines of the way Google and that type of thing. Using code injected or iframe type software can sometimes cause a lot of issues with Google being able to read that stuff, so you just got to do it a certain way. Obviously, putting the information being transparent, as Brad mentioned before, goes into your marketing as well. So, great points, Bill. Shon, what are your thoughts?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Shon Kingrey:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">So, what we&#8217;re changing, our Q3, Q4 objective, and Owen<b> <\/b>this is where you&#8217;re going to come into play obviously is, we&#8217;re service guys, service gals, sorry Anne. We aren&#8217;t marketing people, we don&#8217;t know marketing, we don&#8217;t have degrees in marketing. All. We&#8217;re old-school people. I&#8217;ve been doing this for 27 years. We know coupons. We know oil change coupons. That&#8217;s what we&#8217;ve known for years. Now, we&#8217;re getting to the geofencing thing, which began a year ago, to Bill&#8217;s point, you don&#8217;t even know how to spell geo fencing. But looking at now where we&#8217;re at is we&#8217;re going to go geofencing to the body shops. When a client goes to a body shop, we&#8217;re going to geo-fence them and market to them. Because right now you can&#8217;t get sheet metal and to Bill&#8217;s point, you still got to sell cars or Owen on your point, we still need to sell cars. Great if they sell a car out of the body shop that<b> <\/b>they can&#8217;t get fixed, that&#8217;s good for us. We&#8217;re buying a parts franchise. As a client goes to a parts franchise, a competitor of ours, we can geo fence advertise to them, and let them know that we exist. So, to us, one of the biggest shocks or changes for me in 21 has been the geo-fencing and opening my horizons to it, and looking with it, the traffic that it draws to us.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, 100%. And it&#8217;s funny, I was talking geo-fencing back in 2014 at a lot of different conferences and, and that type of thing. And, of course, it was all for the sale side, but now we&#8217;ve sort of seen it all evolve into the service side of the business, Fix Ops side of the business. And, of course, Fix Ops has many, many pillars too. It&#8217;s not just about service, it&#8217;s accessories and parts and tires, and all those different things. So, Brad, why don&#8217;t you can maybe finish up with our marketing discussion from what you&#8217;ve seen, obviously working with different clients? You’re an ambassador for the industry, what are you seeing out there?<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Brad Paschal:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Yeah, so I&#8217;m going to say two things. So, I knew Owen when he was doing geo fencing Shawn, and I didn&#8217;t buy from him so he had made me come to work for him. So, when I was in the dealership&#8230; so I&#8217;m going to take my Fixed Ops hat off for a sec which I don&#8217;t do very often because I have no hair, but what I&#8217;m going to tell you is, it all starts with knowing where you&#8217;re at and so many people don&#8217;t know where they&#8217;re at on Fixed Ops. They don&#8217;t know how much traffic to their website, they don&#8217;t know where it&#8217;s coming from and I&#8217;m trying to think like when I was in the dealership, what reports would show me how much traffic, when&#8217;s the last time someone sat down and segmented out your traffic, sales, accessories, parts, service, and told you&#8230; hey, you had this many people to your tire page, they came from Google My Business, they came from here, I did a recent study, and 58% of organic traffic that comes in, comes from your Google My Business and so, it&#8217;s very important to know these things because you don&#8217;t have a lot of visibility into your service schedulers. It&#8217;s kind of fragmented in that sense unless you have certain service schedulers, there&#8217;s new ones coming out and there&#8217;s new ones that do really well. Tachyon has really good reports that you can see stuff. I&#8217;ve been working with them to get reports so you can see. Because we have to remember that we&#8217;re relying on a consumer to tie whatever problem they have to an opcode. Well, they&#8217;re not technicians so we have to educate, we have to make the process easy, we have to make it familiar, and then have to measure so that we know where the bottlenecks are so that we can solve those problems.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Awesome, Brad. Well, you know what guys, and Annie obviously as well? I thoroughly enjoyed our conversation today. I&#8217;m hopeful everything that was discussed was something that maybe got somebody on this show thinking about what they can do to sort of taking their Fixed Ops departments to the next level from technology in a marketing standpoint. So, with that, I really appreciate you guys being on the panel. And Ted, I see you jumping back on there, so I&#8217;m going to pass everything back to you my friend.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Ted Ings:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Hey, Owen, I didn&#8217;t know you&#8217;d be such a really good moderator. We got to do this again.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">I&#8217;m a natural.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Ted Ings:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Outstanding panel. Wow, what can I say? Thank you so much, Anne, Shon, Brad, William, and Owen at Fixed Ops Digital, again leading the way on the digital side of service marketing. So, just tremendous job that you do Owen, and thank you for all you do for our industry.<\/span><\/p>\n<h4 class=\"p1\"><span style=\"color: #000000;\">Owen Moon:<\/span><\/h4>\n<p class=\"p1\"><span style=\"color: #000000;\">Thank you. Yeah, I appreciate it.<span class=\"Apple-converted-space\"> <\/span><\/span><\/p>\n[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;full_width_background&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;none&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; bg_color=&#8221;#00a79d&#8221; scene_position=&#8221;center&#8221; top_padding=&#8221;10&#8243; bottom_padding=&#8221;10&#8243; constrain_group_2=&#8221;yes&#8221; top_padding_tablet=&#8221;20%&#8221; left_padding_tablet=&#8221;10%&#8221; constrain_group_4=&#8221;yes&#8221; right_padding_tablet=&#8221;10%&#8221; left_padding_phone=&#8221;0&#8243; constrain_group_6=&#8221;yes&#8221; right_padding_phone=&#8221;0&#8243; text_color=&#8221;light&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221;&#8230;<\/p>\n","protected":false},"author":3,"featured_media":7808,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[311,312],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Marketing &amp; Technology Panel - Fixed Ops Digital<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"LEARN FROM THE BEST\" \/>\n<meta property=\"og:description\" content=\"What technologies they&#039;re using, what is working, and how your dealership&#039;s fixed operations departments should be capitalizing now! You won&#039;t want to miss it. Transcript available.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/\" \/>\n<meta property=\"og:site_name\" content=\"Fixed Ops Digital\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/fixedopsdigital\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-08T21:44:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-09T16:29:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Julie Branum\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"23 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\",\"name\":\"Fixed Ops Digital\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/fixedopsdigital\/\",\"https:\/\/www.instagram.com\/fixedops\/\",\"https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"width\":750,\"height\":200,\"caption\":\"Fixed Ops Digital\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"name\":\"Fixed Ops Digital Marketing\",\"description\":\"Automotive Fixed Ops Marketing\",\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg\",\"width\":1200,\"height\":630,\"caption\":\"The Matrix Panel With Marketing & Technology Experts\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage\",\"url\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/\",\"name\":\"Marketing & Technology Panel - Fixed Ops Digital\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage\"},\"datePublished\":\"2021-07-08T21:44:07+00:00\",\"dateModified\":\"2021-07-09T16:29:53+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.fixedopsdigital.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Marketing &#038; Technology Panel\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage\"},\"author\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\"},\"headline\":\"Marketing &#038; Technology Panel\",\"datePublished\":\"2021-07-08T21:44:07+00:00\",\"dateModified\":\"2021-07-09T16:29:53+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage\"},\"wordCount\":5602,\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-FEATURE.jpg\",\"articleSection\":[\"Fixed Ops Roundtable\",\"Panel\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\",\"name\":\"Julie Branum\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"caption\":\"Julie Branum\"},\"description\":\"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.\",\"url\":\"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Marketing & Technology Panel - Fixed Ops Digital","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/","og_locale":"en_US","og_type":"article","og_title":"LEARN FROM THE BEST","og_description":"What technologies they're using, what is working, and how your dealership's fixed operations departments should be capitalizing now! You won't want to miss it. Transcript available.","og_url":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/","og_site_name":"Fixed Ops Digital","article_publisher":"https:\/\/www.facebook.com\/fixedopsdigital\/","article_published_time":"2021-07-08T21:44:07+00:00","article_modified_time":"2021-07-09T16:29:53+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Julie Branum","Est. reading time":"23 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/www.fixedopsdigital.com\/#organization","name":"Fixed Ops Digital","url":"https:\/\/www.fixedopsdigital.com\/","sameAs":["https:\/\/www.facebook.com\/fixedopsdigital\/","https:\/\/www.instagram.com\/fixedops\/","https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/"],"logo":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#logo","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","width":750,"height":200,"caption":"Fixed Ops Digital"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/www.fixedopsdigital.com\/#website","url":"https:\/\/www.fixedopsdigital.com\/","name":"Fixed Ops Digital Marketing","description":"Automotive Fixed Ops Marketing","publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-SOCIAL.jpg","width":1200,"height":630,"caption":"The Matrix Panel With Marketing & Technology Experts"},{"@type":"WebPage","@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage","url":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/","name":"Marketing & Technology Panel - Fixed Ops Digital","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage"},"datePublished":"2021-07-08T21:44:07+00:00","dateModified":"2021-07-09T16:29:53+00:00","breadcrumb":{"@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.fixedopsdigital.com\/"},{"@type":"ListItem","position":2,"name":"Marketing &#038; Technology Panel"}]},{"@type":"Article","@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#article","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage"},"author":{"@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941"},"headline":"Marketing &#038; Technology Panel","datePublished":"2021-07-08T21:44:07+00:00","dateModified":"2021-07-09T16:29:53+00:00","mainEntityOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#webpage"},"wordCount":5602,"publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/marketing-technology-panel\/#primaryimage"},"thumbnailUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/07\/FOD-FORT-Panel-FEATURE.jpg","articleSection":["Fixed Ops Roundtable","Panel"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941","name":"Julie Branum","image":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","caption":"Julie Branum"},"description":"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.","url":"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/"}]}},"_links":{"self":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7812"}],"collection":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/comments?post=7812"}],"version-history":[{"count":0,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7812\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media\/7808"}],"wp:attachment":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media?parent=7812"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/categories?post=7812"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/tags?post=7812"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}