{"id":7955,"date":"2021-10-18T13:27:29","date_gmt":"2021-10-18T18:27:29","guid":{"rendered":"https:\/\/www.fixedopsdigital.com\/?p=7955"},"modified":"2021-10-18T13:27:29","modified_gmt":"2021-10-18T18:27:29","slug":"owen-moon-on-dealer-talk-podcast","status":"publish","type":"post","link":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/","title":{"rendered":"Owen Moon on Dealer Talk Podcast"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_video link=&#8221;https:\/\/www.youtube.com\/watch?v=qI-8GxrFW9U&amp;t=2050s&#8221; align=&#8221;center&#8221;][divider line_type=&#8221;No Line&#8221; custom_height=&#8221;30&#8243;][vc_column_text]00:00:00<br \/>\n<strong>Herb Anderson:<\/strong> Welcome to the show. We hope you have a blast, thanks for making time for the little podcast. No, the business leader is a penny for your thoughts. This ain&#8217;t no regular conversation<\/p>\n<p>00:00:10<br \/>\n<strong>Owen Moon:<\/strong> Mediators that deal it out. Yeah, what up?<\/p>\n<p>00:00:13<br \/>\n<strong>Herb Anderson:<\/strong> Welcome to another episode of the Dealer Talk podcast. Is your host Herb Anderson? Thank you so much for tuning in. Today, I have a repeat guest on the show. It&#8217;s funny because this person was on the show. Way, way back at the beginning, and now I finally get to have them back and do have another conversation. Get them on. VIDEO So without further ado, let&#8217;s welcome today, Mr. Owen Moon. And what&#8217;s up, dude?<\/p>\n<p>00:00:37<br \/>\n<strong>Owen Moon:<\/strong> Hey, everybody doing, sir. Thanks for having me, man.<\/p>\n<p>00:00:39<br \/>\n<strong>Herb Anderson:<\/strong> Hey, dude, this is awesome, man. It&#8217;s funny. I love having people like yourself. Come on because you are one of the first ones that were were like, Yeah, man, I&#8217;ll give you guys a shout out on the show. And now I got your back for season six, bro. It&#8217;s crazy.<\/p>\n<p>00:00:54<br \/>\n<strong>Owen Moon:<\/strong> Yeah, I&#8217;ve been watching you as you&#8217;ve kind of progressed through all these seasons and you know, it&#8217;s been awesome to watch. But yeah, I was fortunate to, you know, jump on with you. I think it was cold on my end. Anyway, as a cold January day, a couple of two or three years ago. And you know, we were just kind of getting fixed up digital started. And so I think, you know, obviously you always try to, you know, bring good value to your audience and, you know, just to kind of hit it. That fixed off, I thought, was a great move on your part because nobody was talking about it back when we were when we did that first, that first discussion. So.<\/p>\n<p>00:01:28<br \/>\n<strong>Herb Anderson:<\/strong> Yes, sir. Yeah, no. And I loved having you guys on to because I thought at that time I was knee-deep working with dealers on the fixed ops side of things, and I thought what you guys were doing was pretty innovative. I still think that it is. I mean, it&#8217;s funny because as a year has progressed, you guys still seem to be the only ones that are really putting fixed stops at the forefront when it comes to marketing strategy. So I think that&#8217;s that&#8217;s pretty awesome.<\/p>\n<p>00:01:55<br \/>\n<strong>Owen Moon:<\/strong> Yeah. You know, we learn every day and we learn from our clients. We learn from, you know, great people like yourself and other industry professionals that, you know, I&#8217;ve had the luxury to, you know, getting to know over the years that I&#8217;ve been in doing this. And, you know, we just try to get better every day with what we do and kind of evolve our program, evolve our solutions. And you&#8217;re right, though, I mean, I was just a digital dealer with my team. We had a booth there and Brad Paschal and I both spoke at the event. And it was amazing because two and a half years later, we&#8217;re still the only fixed ups booth, you know, really there for from a marketing standpoint or from an advertising standpoint. So, you know, we&#8217;re definitely taking that lead and we&#8217;re proud to sort of be the leaders in this. And, you know, but we still know that we got to get better every day and that&#8217;s what we strive to do every day when we get up. It&#8217;s, you know, not only working with our stores but also working on our program and our technology to get better as well. So never satisfied, right?<\/p>\n<p>00:02:54<br \/>\n<strong>Herb Anderson:<\/strong> Right on, man. Yeah, definitely want to talk about about about the growth and where you guys are at. We typically kick things off in the back room, but we already did that. So let&#8217;s just let&#8217;s talk about kind of the progression from our first conversation to today, like what&#8217;s happened in those two and a half years.<\/p>\n<p>00:03:12<br \/>\n<strong>Owen Moon:<\/strong> Yeah, we&#8217;ve been, you know, we&#8217;ve been blessed to be a dealership or a group that has been very busy even though COVID last year. I think, you know, I knew that going into 2020 was going to be a big year for fixed ups just because it kept building momentum. We had kind of been out there screaming from the rooftops about the importance of transitioning your fixed ops department to digital. I think what ends up happening is when COVID hit as bad as it was for our country and for just, you know, people in general with the lockdowns. And you know, the, you know, just what COVID presented from a challenging standpoint, it really helped the fixed ops department because, as you know, we had to kind of for a while anyway, a lot of dealerships had to scale back their sales. Some even had to close their sales department. But the fix outside of the business was still, well, still open for business. And you know, the government came in and said it was an essential part of the business or an essential business. So for us, it was, you know, we were like a magnifying glass. All of a sudden the scope was on us. And, you know, since we were really the ones that we&#8217;re providing the most value from a solution standpoint and from a marketing standpoint, it helped us. You&#8217;ll really continue to just kind of status quo business as usual per se. I mean, there were some things that we had to do a little differently, really pushing the sanitation and the pickup in deliveries and some of that new business, I guess, culture, things that we had to adapt to very fast as an industry. But we sort of led that charge. And like I said, it helped us double in size last year and we&#8217;ve had some great growth again this year. So and we feel like we&#8217;re just getting started, you know, three years, three years, we just celebrated our third year anniversary last week brought. All of our teammates out to Denver and had a big celebration and as well as some vision casting meetings and things like that, and you know, it&#8217;s funny. I mean, I&#8217;ve been doing this twenty-one years and I feel like I&#8217;m just getting started in this thing with fixed off digital. So the sky&#8217;s the limit. And you know, we&#8217;re just plugging along every day and serving the dealers that we have the opportunity in the, you know, the ability to work for.<\/p>\n<p>00:05:22<br \/>\n<strong>Herb Anderson:<\/strong> So yeah, dude, it&#8217;s definitely been nice to see you guys grow again. I was brought up in the industry on the fixed ops side of things, right?<\/p>\n<p>00:05:31<br \/>\nOwen Moon: Yeah, that&#8217;s where you said you got your cut your teeth. I remember the<\/p>\n<p>00:05:34<br \/>\n<strong>Herb Anderson:<\/strong> The first year, so it&#8217;s I&#8217;ve always felt like it&#8217;s one of those areas that&#8217;s really just underserved on the marketing standpoint, you know what I mean? And then to see you guys really focus on that, not just focus on a sense that, hey, let&#8217;s just go sell dealers marketing stuff for service, but really offer solutions that makes sense in the digital world that we live in, right? And then to see that, to see that, that growth, I mean, you guys definitely deserve that. You know, you talked about COVID and I had a couple of conversations because, for me, that was one of the areas that I felt that during COVID like sales size was probably not, probably, but they could have been more prepared because of digital retailing and all these things already existed. But I think for the service side, it was just overnight like, boom, like you got to change the way you do business, either you were one of those progressive dealers like, you know, like the paragon of Honda&#8217;s of the world or whatever where they were already picking up people and all of those things. But I think that Brian&#8217;s strategy there was more just out of necessity because of where he is geographically his location. Yeah, but I think the majority of dealers were not doing any of that stuff, and they weren&#8217;t even looking at that stuff. And so then all of a sudden, now you have to not just you got to find a way to service customers. It was considered essential. So, you know, all the pressure was on you to produce for everybody in that dealership more than ever before. Quick changes in the physical experience. I mean, think about it, it&#8217;s personal, it&#8217;s a personal side of the business. But now all of a sudden you have to be a personal touch without that personal contact or connection. You know, shields and things of that nature, which just makes it really hard to and then masks, right? It makes it really hard for you to communicate. And then an influx. Everybody wants to get their car fixed. They want to make sure that their cars run in tip-top shape. And you kind of like all these elements to that. What do you think was the biggest, biggest impact because of the situation that we faced?<\/p>\n<p>00:07:41<br \/>\n<strong>Owen Moon:<\/strong> Well, I think the biggest impact for at least from our end was the fact that we were able to provide customers with information without them having to leave their house. You know, we always talk about how, you know, with our solution, we&#8217;re trying to provide information, education, and recommendations to the dealership service customers. And the one thing that I know is that when everybody was at home or even just working from home, now that type of thing. Website traffic went upright. Everybody saw a rise in my website. Traffic wasn&#8217;t necessary, you know, on the sales side, people that were looking to buy. But for some reason, we still had a very high influx of visitors coming to the website. So the guys, the dealerships that were working with us already had that infrastructure in place on the service side. And we really stress the importance of providing, you know, more offers on your website, making sure that your customers are able to find that information that they&#8217;re looking for and then kind of bring it farther down into what we call the service detail page or just getting the information about that particular service. And then, of course, making it easy for a customer to engage with the dealership, whether it&#8217;s calling them Saturday an appointment online, that type of thing. I think the ones that were working with us that were already kind of in the trenches really saw a benefit from that and that, I guess, change in customer behavior. And then the newer customers that we were able to bring on during that nine-month period got to see it relatively quick catch up because a lot of guys we talked to at the beginning, they only are showing a couple of specials. You know, they believe that coupons are kind of the way to go. It&#8217;s, you know, they have this coupon strategy and, you know, I make jokes that, you know, kind of and that it&#8217;s not a joke, but it&#8217;s saying, Hey, you know, coupons are dead, right? We&#8217;re not a coupon company in our industry. We&#8217;re an information industry. We want to get our offers out there. You know, we don&#8217;t necessarily need to discount. We need to just win through information on why it&#8217;s more important to come to the dealership than a third party or an independent because, you know, that&#8217;s the other side of it is those guys are gunning for us every day to try to take that business and you got to combat it through, you know, sort of the value props. Why is it important for a. Dealership or customer to get their vehicle serviced at a dealership? Those all go into, you know, the I guess, the infrastructure kind of what we do for our stores. But it&#8217;s important and whether we do it or you do it yourself or you try to find somebody else. The nice thing about us is that we kind of do it. We have it all together. So you don&#8217;t have to have that fragmentation of having three or four different vendors trying to complete that mission, so to speak.<\/p>\n<p>00:10:24<br \/>\n<strong>Herb Anderson:<\/strong> So, yeah, so you know, full disclosure, like I use you guys for some of the stores that I work with. And so I&#8217;ve been able to experience the product firsthand, not just seeing demos and things of that nature, but I actually I&#8217;m a customer of you guys. I think that that there&#8217;s the. I think that the service that you guys provide is pretty invaluable because you&#8217;re creating to your point, you&#8217;re creating strategies that are based number one on which to me is the number one. It&#8217;s the long-term success strategy when it comes to marketing for any job, right? The better your goal is, the more you&#8217;re going to win. I feel like that&#8217;s an area like I said that that is deficient in the market like we don&#8217;t like. When you have these companies marketing conversations, everybody&#8217;s always talking sales for whatever reason, right? And fixed up just isn&#8217;t a part of those discussions. And so why do you think that is? Why do you think that we still don&#8217;t are fully committed to that side of the business that&#8217;s so profitable? Do you think that we&#8217;re we just feel like, well, I mean, service is already profitable, so let&#8217;s just focus on the sales side, or do you think that we just don&#8217;t like it? I just don&#8217;t understand the why. You know,<\/p>\n<p>00:11:47<br \/>\n<strong>Owen Moon:<\/strong> it&#8217;s a great question. And I think that you know, some of the answers lie in from the top down. I mean, the OEMs obviously are really pushing sales, sales, sales, you know, more inventory, right? They want you to buy more inventory or allocate more inventory, which means that you have to focus on the sales side. I think another key element of this is the time factor. There&#8217;s only so much time that you can allocate to the fixed ops department. And what I mean by that is unless you&#8217;re going to, you know, longer days or 24-hour shifts, you know, there are so many hours that you can make money in those days. And so I think what dealerships typically have had in the past is just the mentality of, hey, where it&#8217;s going to take what we can get, we&#8217;re going to service everything that comes to us and that&#8217;s going to be good enough. But I think in today&#8217;s competitive culture, competitive environment, you&#8217;ve got to be more strategic and that&#8217;s kind of where we&#8217;ve kind of set ourselves apart. I think some of our competitors are now starting to pop up. I mean, you know, everybody wants to automate everything and everybody wants to use the software. You see all these widgets that are getting plugged in on the sales side. And I think that that&#8217;s the part that that really sets us apart is our people. You know, our performance team has years of experience working with dealerships from a strategy standpoint. And when you look at all the different areas of your fixed office department, you know your parts, tires, collision accessories, these are all the specific strategies that have to be addressed individually, and no plug-and-play software type solution can just get that done. So I think that it started to kind of back into your question. It starts with the OEM that starts with, you know, where is the focus? I have had a lot of great conversations with some OEMs over the last year, year, and a half, and I can tell you that&#8217;s changing. And you can feel it now in the dealerships as well, that they are now starting to look at what we just did. A panel on the fix-ups roundtable and one of my dealer&#8217;s clients that runs a big store, a big group out of Indianapolis said we finally have the seat at the table when it comes to our website. And, you know, it&#8217;s just all those little things, right? Are just are starting to kind of all come together to allow companies like ourselves to really help service the dealership community and kind of how to get to that end result, which is more profits, maybe better services that are going to make you more money and not just focusing on the what can we just take what we can get kind of mentality.<\/p>\n<p>00:14:23<br \/>\n<strong>Herb Anderson:<\/strong> So, yeah, no, I like that comment of having a seat at the table. I think that that&#8217;s where it always should have been. I mean, when you think about that, the profit that you make in relation to selling cars is just vastly disproportionate in your favor on fixed stops, right? So why? I just I&#8217;ve never understood that. And I and those are some of the things that I struggle with myself when I was managing and things of that nature.<\/p>\n<p>00:14:52<br \/>\n<strong>Owen Moon:<\/strong> Yet just think about how much more money your service advisor makes the dealership than maybe a salesperson. And yet all the efforts going over there and nothing over here. So it&#8217;s just, you know, it&#8217;s crazy.<\/p>\n<p>00:15:03<br \/>\n<strong>Herb Anderson:<\/strong> Yeah. And that&#8217;s a good point. But you go, What do you? Let&#8217;s talk about innovation, right? Because you guys are obviously like you said, you&#8217;re leaning from, you know, from the front sort of a deal that people, you know at this point will have to chase you guys because you&#8217;re just you&#8217;ve been at it the longest. And the strategy that you guys are implementing is just so, in my opinion, right for the digital world that we live in. What&#8217;s the future of this thing? I mean, I was having a conversation the other day with one of the fixed-up&#8217;s directors with this group that I work with. And he was talking about this idea of having his own service website like completely removing it. Everything, it&#8217;s still a dealership website, but it&#8217;s 100 percent all service-related. And I thought that was a pretty interesting idea. I don&#8217;t know if it&#8217;s the best strategy and I have to really think about it, but there was something there that got me to say. What do you think? What do you see here for fixed-ups now?<\/p>\n<p>00:16:05<br \/>\n<strong>Owen Moon:<\/strong> Well, it&#8217;s funny. You say standalone service website because we&#8217;ve actually done some of those. That&#8217;s kind of where this whole company kind of ballooned from was two of my partners were actually doing standalone websites for the service side down in the Texas area. And the challenge that we ran into and we were looking at this was that a lot of the OEMs are kind of saying, no, you have to do everything on the OEM site. So dependent on them, which is the OEM you are obviously working with. You know, there can be some, some limitations there and what you can do. Also, we felt like we get so much traffic coming to our main website that it&#8217;s, you know, you want to take advantage of that traffic because a lot of those people will come over to the service side. You want to have those that information, you want to have those specials, those offers out there, that type of thing, you know, you know, a hundred percent, right? We are leading from the front. So a lot of what we do is just kind of looking at it through a lens of what the dealers are telling us is important. I see too much fluff out there in the industry like, you know, we drove this many text messages and so this many emails. It&#8217;s not that that&#8217;s bad. It&#8217;s not like those aren&#8217;t a part of maybe a part of what the solution could be or what the the the, I guess, the mousetrap for the customers could be. But if it&#8217;s not making, you know, making it to the actionable conversion which is setting the appointment and by itself, I don&#8217;t believe there&#8217;s any value there. So, you know, we&#8217;re just constantly like we rolled out our video product about eight months ago and that&#8217;s taken off like crazy. My video team is is some of the best from a creative standpoint that I&#8217;ve seen out there. And so, you know, we do these semi-custom videos, we try to make them, you know, very, very high quality, but yet still have some of that, you know, some of that efficiency. So we&#8217;re not having to charge the dealers, you know, a lot of money to build these because, you know, most dealerships don&#8217;t have a huge digital budget for their fixed cost departments. So, you know, we&#8217;re kind of doing what we can inside a very limited in a limited environment when it comes to budgets and things like that because everyone&#8217;s still throwing all the money on the sales side, right?<\/p>\n<p>00:18:19<br \/>\n<strong>Herb Anderson:<\/strong> Yeah, yeah, of course. Like, sell more cars. So it&#8217;s funny you mentioned the video because I definitely wanted to talk to you about that, and that&#8217;s to me. That&#8217;s again, it just it&#8217;s just credit to you guys for seeing the value there. Yeah, I want to expand on that because I want people to understand how important that is. Obviously, we know that that consumer-like videos versus reading, for example. So right there within itself, there&#8217;s an advantage, but there&#8217;s also and if you do it right, there&#8217;s an SEO advantage there as well. There&#8217;s your product offer that. I mean, could you say that that the video of a product that you guys offer will give a dealership and SEO boost?<\/p>\n<p>00:19:08<br \/>\n<strong>Owen Moon:<\/strong> Absolutely. And that&#8217;s kind of where we started with it. We knew that it would be an engagement addition on our content pages and on the website. But we started with it from an SEO standpoint because we said if we can get these videos to rank and the way we do it is is very unique in how we kind of connect YouTube with Google and just some of the things that we&#8217;re doing from that standpoint. Ultimately, what we&#8217;re doing is we&#8217;re pushing down your competition. So, you know, part of this, there are really two sides to, I think, a strategy like what we do, it&#8217;s the on website strategy. It&#8217;s getting more information to customers as they&#8217;re there because I don&#8217;t know about you, but even taking the automotive industry out of the whole conversation. If I am online and I&#8217;m looking for something and I click into that particular website and either start me back at the home page, or there&#8217;s really no information, you know, I&#8217;m going to maybe balance, you know, not really. Yeah, I&#8217;m done. I&#8217;m out, I&#8217;m going to go. So that&#8217;s kind of the first thing. But everything we do and I think this is what I can say, you know, one of the proudest of is that we all do it with the SEO and with the search engines as the kind of the oh, with that in mind, right? We just want to make sure that we&#8217;re doing all of Google&#8217;s best practices and that we&#8217;re giving the customers the dealership customers. I should say a value there. So as we continue to drive in more traffic into your website, it&#8217;s because we&#8217;re gaining that visibility. And I, you know, I see I see there are companies out there that do, you know, code injected or iframe solutions. And Google is telling us that&#8217;s just not the way to get a. Ability, I mean, they&#8217;ve come a little far there a little bit in terms of being able to read some of it. But you&#8217;re just going to have limitations and that&#8217;s, you know, ultimately we don&#8217;t want to, you know, we don&#8217;t want to, you know, limit our capabilities for our customers.<\/p>\n<p>00:20:59<br \/>\n<strong>Herb Anderson:<\/strong> So let&#8217;s break it down just for those who are looking at maybe getting that extra boost, right? So you have the content side right to you. Let&#8217;s say that if you&#8217;re doing it right, you shouldn&#8217;t have coupon pages anymore because I agree that&#8217;s a that that&#8217;s done as far as I&#8217;m concerned. If you should have as sort of a service menu page, write your offers on there with the price not even discounted, just what you charge for that, for that, for that service and then layering content on top of that, explaining that service because that&#8217;s going to help you with wherewith Google and stuff ranking, right? Because you have pages, you have content, they&#8217;re written down on that specific service. And then on top of that, you can now incorporate a video and layer it onto that piece of communication that are now well received. Not only do they see the content and I know that you guys build them, but some of them also are or most of them are Q&amp;A sort of style right to rank better. But now you can embed that video into that same piece, right? So as that was that kind of like the strategy. So you have that layered on top of that content piece. So now it&#8217;s just it just helps you rank better.<\/p>\n<p>00:22:12<br \/>\n<strong>Owen Moon:<\/strong> Yeah. And it&#8217;s very similar to what we&#8217;ve seen work on the sales side. And you know, of course, I spent a lot of years over there exclusively. So, you know, looking at it from an SRP to VDP standpoint where, you know, let&#8217;s say I&#8217;m at a forward store and I&#8217;m looking at all the Ford F-150 cars. And then as a customer, I want to just kind of dive into one particular vehicle. Maybe it&#8217;s the right color, the right options, you know, the right price, whatever is my motivation to get in there. That&#8217;s when you dive into that vehicle detail page and now you&#8217;re getting video, you&#8217;re getting descriptions, you&#8217;re getting more information. Maybe you&#8217;re getting different ways to buy lease things like that, right? We&#8217;re using that same logic, but obviously adapting it to our service customer. And what I and what we mean by that is you&#8217;ve got your service menu page or what we call the SMP, and then we&#8217;re drilling down into a service detail page or a step where we&#8217;re, you know, letting the customers kind of sort and filter different segments of inventory. But then they want to look at one particular piece of inventory. You know, they&#8217;re going in and they&#8217;re finding out more about that car. Maybe better descriptions of video, different ways they can buy or lease that type of thing, or use that same logic. Here we&#8217;re taking it from an S&amp;P into what we call an ESDP or a service detail page. And of course, with the service side, the goal is an appointment. I mean, that&#8217;s ultimately what we&#8217;re trying to do is create enough information, get that information out there to that customer enough where they feel very comfortable in setting an appointment with that dealership. And that&#8217;s always the goal.<\/p>\n<p>00:23:44<br \/>\n<strong>Herb Anderson:<\/strong> So now more than ever, businesses need more efficient sales. That&#8217;s why thousands of dealerships trust us to help with things like automated inventory, email updates, and ensuring all of your leads get into the CRM to try for ICE for free, visit for Ice Dot iOS slash dealer talk. That&#8217;s for Ice Dot Io slash dealer talk.<\/p>\n<p>00:24:11<br \/>\n<strong>Herb Anderson:<\/strong> Well, we got to think about the customer journey, Ray, because when you think about it, service is it. You&#8217;re capturing consumer intent right there, either in a distressed situation, some sort of issue with their car or they&#8217;re just looking for a service and they&#8217;re trying to save money, basically. I mean, so they&#8217;ll go to Google, search for those things. So the more information you have and you know, like I, I keep having this conversation with dealers and we talk about content for some reason, they have this idea that they have to have these long pages of words. See what I mean? That&#8217;s not what I mean. I&#8217;m not going to say that that doesn&#8217;t rank. And having a lot of words isn&#8217;t a good strategy because, you know, for Google reasons, but you got to think of your customers experience at that moment like nobody&#8217;s going to want to read 13 plus words, thirteen hundred plus words of content like they give you going to create an experience. You have to have content, you know, some pictures and images, you know, having the video on, there&#8217;s going to. Greatly enhance that experience. I think about it, they get to the page because the content is there, so Google was able to put your information above the rest. You&#8217;re going to pull them into your website and then once they get there, they&#8217;re going to have a video that&#8217;s going to help them consume that information quicker. And that&#8217;s going to ultimately influence their decision or their call to action, which is to schedule that appointment. And that&#8217;s really what you should want for your service. Experience on your website is to get to always point more service appointments.<\/p>\n<p>00:25:52<br \/>\n<strong>Owen Moon:<\/strong> Well, insert in-service traffic by far is more important than sales traffic. Sure. And I people don&#8217;t understand that, you know, they look and say, Well, I&#8217;ve got to have thousands and thousands of visitors. I don&#8217;t need thousands and thousands of visitors. I need hundreds, but I need the right visitors. And to your point that you just said, I talk about a lot, is there something that has changed in their life, right? They&#8217;ve had an issue with their vehicle. And maybe that issue was coming on for a while, but it&#8217;s now gotten to a point where they can&#8217;t ignore it anymore because people don&#8217;t want to spend money on service. I mean, that&#8217;s just what I hate spending on. I would say, I hate spending money on stuff that gets me back to even, you know what I mean? Lots of money. I want to buy a new golf club or, you know, new tires for my, you know, for my car because it&#8217;s, you know, it&#8217;s a new wheel. I mean, you know, I got to go buy new tires, got me back to even, you know, that&#8217;s where I was two years ago. I hate it. So, you know, service traffic is focused more on. I got a problem today. I got to go find somebody to help me solve that problem. And we&#8217;re just helping our dealerships meet them at that. Meet them at that point, right? Meet them at their point of need and then giving them all the resources to be able to make a decision on why they should come to that dealership, as opposed to maybe an independent or a third party just right down the street. You know, it kind of thing<\/p>\n<p>00:27:09<br \/>\n<strong>Herb Anderson:<\/strong> to perfect segue way right there, by the way, because I just wanted to bring that up because I always like to talk about the independents. I do still feel and I don&#8217;t know if correct me if I&#8217;m wrong, because you&#8217;re definitely doing this more than I am, especially these days. But I still feel like the independents have a better grasp of their digital marketing strategy than dealerships do. I mean, you feel that that&#8217;s still the case. What are you seeing on your end? But more importantly, just for a leave-behind piece, what can we do to win more?<\/p>\n<p>00:27:42<br \/>\n<strong>Owen Moon:<\/strong> Well, again, I think it comes down to what are we, what&#8217;s our value proposition compared to the independents? For years, the independents have been working off of value and convenience. That&#8217;s how they&#8217;ve been winning business, where the more convenient options, where we&#8217;re cheaper, whether it&#8217;s right or wrong, that&#8217;s what they&#8217;ve been pushing. So we have to come back with what ours, our value props, or what our I guess advantages are. And that&#8217;s when you talk about, you know, the equipment, you know, all these cars are sophisticated. You have to have the right equipment, OEM parts, OEM fluids, master techs. These are all reasons why somebody should come and get their vehicle serviced at our dealership as opposed to at an independent. And so just by itself, you&#8217;ll never win the price game, right? Someone says, Hey, I need an oil change, and it&#8217;s ten dollars cheaper. Again, going back to my last comment, nobody wants to spend money on service, so of course, they&#8217;re going to, you know, just by nature, go, Hey, that&#8217;s ten dollars cheaper. That&#8217;s ten bucks in my pocket. But if they know why they should be coming to the dealership, why it&#8217;s important. And again, no coupon strategy is going to get you there. No discounts are going to get you there. This hundred percent is about informing, educating, and giving recommendations to consumers on why they want to use a dealership to get that service done, especially some of those laid ownership services. You know, oil change, OK, it&#8217;s not. There&#8217;s not a lot to it, right? I mean, you know, you could say you could get away with going to maybe an independent if you need to on a whim. But hey, you start talking about transmissions and alignments and different things like that. You&#8217;ve got to go to where those dealerships have the right equipment for you, and for that customer.<\/p>\n<p>00:29:25<br \/>\n<strong>Herb Anderson:<\/strong> So no, I totally agree 100 percent. And I like that you brought up the information side and you talked about it earlier and I wanted to interject. There is one of the education marketing them like there is such a thing as and I thought, I think especially when we first started with Corvette and all that, it was a perfect time to do that. Like when would there be a better time to educate your customers on why they need to schedule an appointment before they come in? Or why we do the things that we do with the things that we&#8217;re doing differently now at the dealership because of it, like, you know, sanitizing things of that nature or redoing keyless services, are we picking up and dropping off customers the convenience factor like all those things? So my question is, do you feel that we don&#8217;t do enough of? Or is that something that we need to incorporate in our strategy, not just, hey, we have these services, but educate our customers on the behaviors that we want them to have when it comes to servicing their vehicle?<\/p>\n<p>00:30:31<br \/>\n<strong>Owen Moon:<\/strong> Yeah. No good points. I think I think there&#8217;s a couple of parts that got me. Your question kind of brings me in two different directions. The first is the pre-appointment, right? The pre-appointment is a way for you to educate customers. And if you do it right, you can pick up additional services or what we call more lines per R0 at that point of the employee at the appointment, right? Because customers might say, Well, I&#8217;ve never had my wheels tires rotated, I&#8217;ve never had this particular service done. Let me go ahead and ask the dealership when I get there about that because if it&#8217;s important, I want to get it done. But I think the other side of it is to be able to arm your service employees or your advisers and different things like that your, you know, your coordinators to be able to give them information. So if, for example, you know, your technician comes back and says, Hey, there&#8217;s here&#8217;s things that need to be done to this vehicle, that&#8217;s always a time when the customer has their guard up because they&#8217;re going. I came in for an oil change and now you&#8217;ve got another five hundred dollars that you want to hit me with. Well, if I can bring him to the website and let him hey ahead and read on this service, find out why it&#8217;s important and what the OEMs are saying from a recommendation standpoint, those are all different ways that we can kind of win through that same environment. So I think it starts at the front end by being able to educate and market at the front end. But then it carries into the actual arm, the dealership lot experience that you can provide them as well. So if you&#8217;re doing it right from all the way through, I think you see that it&#8217;ll be a much less tense situation when you go to actually have those conversations with those customers that you&#8217;re having to give them some bad news, let&#8217;s be honest, you know.<\/p>\n<p>00:32:19<br \/>\n<strong>Herb Anderson:<\/strong> So yeah, I mean that. And that&#8217;s why the advisor has one of the toughest jobs to ride because it&#8217;s not been predicated on giving customers bad news.<\/p>\n<p>00:32:32<br \/>\n<strong>Owen Moon:<\/strong> It&#8217;s like being a doctor, right soldier<\/p>\n<p>00:32:34<br \/>\n<strong>Herb Anderson:<\/strong> on your vehicle, doctor. It&#8217;s funny, man. All right. So I want to I definitely want to get your perspective on traditional marketing because it&#8217;s one of those things that actually dealers still do allow mailers and things of that nature. And I just, you know, what&#8217;s your comment? Is it? Is it at this point? Would you say it&#8217;s a complete waste of money or does it have a place in your marketing strategy? Maybe a combination of the two, right? Omnichannel. If you look at, depending on your definition of a book, for me, omnichannel is the same message, same look and feel multiple channels and those could be digital channels, or they can be traditional forms of an advertising channel. But what&#8217;s your take? What are you seeing in the market?<\/p>\n<p>00:33:18<br \/>\n<strong>Owen Moon:<\/strong> Well, yeah, it&#8217;s a great question. And obviously being an agency guy, you know, I spent a lot of years where we didn&#8217;t have digital. It was just TV radio, you know, mailers, newspaper stuff like that. I think what I&#8217;ve seen a lot of is when you do with some traditional, you do see a spike in website traffic because a lot of times what ends up happening is someone hears an ad, sees an ad, gets a mailer in the mail, they go to the website. So it still comes back to what are you doing for that customer that when they come there, they&#8217;re not just coming, they&#8217;re not finding any info. So I think, you know, yeah, can you say that direct mail is kind of expensive? Obviously, if you&#8217;re doing ten thousand fifteen dollars and twenty thousand saturation type mail mailers, it can add up pretty quick. But if you get into very specific, you know, sort of audiences where you&#8217;re, you know, hitting those recall customers or hitting those lost souls, people that haven&#8217;t been back and you&#8217;re offering them a got one time, you know, oil change price that&#8217;s going to lose you some money, but at least you get that conversation going with that customer. I don&#8217;t think that&#8217;s a bad thing. I think that you can be very, very, very economical with it. But you still have to understand that the first thing they&#8217;re going to do is they&#8217;re going to go to your website. And if you don&#8217;t have information there, it might just be a waste. It might be a wasted opportunity for you, you know. So that&#8217;s what I was saying in email marketing. I kind of throw email into a traditional there is obviously some digital aspect to that, but we&#8217;ve been doing email marketing on the service side for years. Again, everybody wants to drop that email blast into a schedule service page. It&#8217;s too soon. You know, we understand we&#8217;re trying to earn their business and we&#8217;re trying to make us as the authority. So we have to bring them through a path when it comes to marketing. So, you know, that&#8217;s all I would say is if you don&#8217;t have a good digital strategy, it can be a waste of a traditional strategy. Whatever you do, invest in it.<\/p>\n<p>00:35:17<br \/>\n<strong>Herb Anderson:<\/strong> Yeah. You know, it&#8217;s funny because, you know, obviously we keep going back to the service catalog because that&#8217;s what that&#8217;s the ultimate action, right? That&#8217;s what we want to see. But yet in this, this reference is a bit old, folks. So you know, if I&#8217;m out, if I&#8217;m outdated, apologies in advance. But I remember there was probably three years ago I saw this article and in the fixed up&#8217;s journal and it was talking about utilization of the schedule. And it was, I think that the average was 20 percent. So 20 percent of customers are using our scheduling appointment with that schedule. And so my question is what can we leave behind here for people that are listening in? If that&#8217;s really the case, that their story, let&#8217;s say it&#8217;s 40 percent, let&#8217;s even say it&#8217;s 60 percent, which I don&#8217;t think it&#8217;s that high, but let&#8217;s say that is what can we do to get more of that 40 percent to schedule an appointment online prior to their visit?<\/p>\n<p>00:36:22<br \/>\n<strong>Owen Moon:<\/strong> Well, I think a couple of things that we&#8217;re trying to do, I think it&#8217;s always going to be the, you know, the challenge right is just how to get customers to adapt. Now certain brands are much better than others. Subaru, Volkswagen, they&#8217;re typically the number one or number two brand when it comes to their customer scheduling online. They&#8217;re used to doing things on their own. But one thing that we&#8217;ve done and I think have really set ourselves apart from, you know, again, kind of going back to more the performance side and the, you know, kind of working hand in hand with our customers is we will actually help coordinate inside the scheduler. And so what I&#8217;ve seen and what we&#8217;ve seen, especially when we do this with a lot of our dealers, is they might have an offer out on their website for a certain price. And then as that customer gets into the scheduler, that price might be $10 dollars higher because it never got changed. Well, right, there is a trust issue and all of a sudden guys are like, they&#8217;re trying to ding me another 10 bucks. I&#8217;m out, and that&#8217;s why they defect. So, you know, the abandonment rate goes up. I think, you know, there&#8217;s a lot of things that can be done. I think schedulers still need to evolve. And I think it will. I think they will, you know, or maybe somebody comes along with something a little better, you know, and I think that&#8217;s something that we as a company, we look at every day and say, Hey, is it worth going down that rabbit hole or do we just try to make what&#8217;s out there? Because there&#8217;s a lot of companies that offer stuff like that. You just try to make it better, you know, just try to work within the framework and make it better. And I think that&#8217;s what we&#8217;re, you know, that&#8217;s what we do every day is just what things do we try to tackle as a company and what things are we just try to make better know with the partnerships that we have.<\/p>\n<p>00:38:05<br \/>\n<strong>Herb Anderson:<\/strong> So do you say that the schedulers? Listen, I&#8217;m not trying to call anybody out. Like, there are multiple options out there. No question. So I&#8217;m not naming names. But do you think that just that what&#8217;s available to us right now is still a little bit clunky or complex?<\/p>\n<p>00:38:24<br \/>\n<strong>Owen Moon:<\/strong> So Kevin Comma is one of my business partners. It says this a lot, and he says this to our team a lot because we work really closely with like X Time and some of these other ones. These schedulers were made to be operational schedulers, right? They were operational first, and then they said, Oh, let&#8217;s go ahead and put them on in marketing websites, whatever. That&#8217;s the problem. They&#8217;re operational first. They didn&#8217;t take into consideration marketing. So what somebody needs to come up with is what we need to keep talking about is how to make these things more marketing schedulers or customer-facing schedulers, not internal schedulers that the, you know, the service departments working inside of. So that&#8217;s where the disconnect comes in. And I think that I think that they&#8217;re getting better. I&#8217;ve seen some different ones out there that, you know, people are constantly coming to the table with their version of what&#8217;s going to be the answer. And I think we just got to keep pushing the industry to be better. And whether we&#8217;re doing that or whether somebody else is doing that. You know, that&#8217;s kind of the mission is to create that, that frictionless experience for customers. And I just don&#8217;t think people were. We&#8217;re looking at it from a marketing standpoint when they created this scheduler scenario.<\/p>\n<p>00:39:34<br \/>\n<strong>Herb Anderson:<\/strong> So now it makes a whole lot of sense to go good. It&#8217;s a good way to put it not thinking about it. Yeah, that&#8217;s exactly what the experience is like. So that makes a lot of sense. And I don&#8217;t know, maybe you guys will come up with something in the future and continue your ascent? You never know. You never know. All right. So we&#8217;re getting close to that time. There is one topic that I wanted to talk about, and I guess I don&#8217;t know how involved it is yet, but I definitely feel like it&#8217;s going to be in the not too distant future. It should be anyway. And that&#8217;s text marketing for the service side. Like what&#8217;s going on? When are we going to be able to actually say we can do this, we can send customers offers to their phone, 98 percent open rate. What&#8217;s that look like now?<\/p>\n<p>00:40:30<br \/>\n<strong>Owen Moon:<\/strong> Yeah, I think your text obviously is big, right? I mean, more people read their text messages, open their text messages than email. I mean, it&#8217;s almost two to one in terms of that, that scenario. We&#8217;ve looked at text. We think the text has a future with us. What we are trying to do is really look at conversational texting. You know, too many times I see texts, plans, or text programs out there where it&#8217;s like, Hey, text me this offer, and all they&#8217;re doing is sending the link back to the place where the customer was just at the right. There&#8217;s no value there because I was just at your website looking at this offer, and now you&#8217;re going to send me the link to that offer. Well, yeah, maybe it&#8217;s in my phone now, but it&#8217;s also in my history or it&#8217;s sitting on a browser in my phone. So. So what we&#8217;ve looked at and what we constantly discussed is how to evolve texting. So it&#8217;s not just an informational type scenario where it&#8217;s actually something that the customer and the dealership can communicate back and forth and work towards an appointment and that type of thing. And so I think that that&#8217;s and there&#8217;s some of that stuff&#8217;s doing that. I think I&#8217;m especially on the sales side. I&#8217;ve seen that it just hasn&#8217;t quite evolved all the way to the service side. And when I say that I&#8217;m talking about your conquest and right, when when you just are working inside your website or in a marketing scenario and on a search engine, you know where you&#8217;re driving customers in that type of thing. There are a lot of solutions right now for that customer that&#8217;s already in your database or in the service drive and now you want to start communicating with them. So I think they figured that part out a lot of there&#8217;s a lot of companies out there that do that, just not again, just not from a marketing standpoint that I think will eventually come. And, you know, you call them a rewards program, you can call them a text club. You know, there are all these different things that you can call it. But at the end of the day, it&#8217;s still about being able to communicate back and forth via text message because a lot of consumers want to want to use that medium to communicate. So.<\/p>\n<p>00:42:44<br \/>\n<strong>Herb Anderson:<\/strong> Absolutely. And I know I love that answer, and I think that I&#8217;m excited about that. I think that&#8217;s going to be a step in the right direction. And to your point, not just so much on the offer side of sending people because I mean, you can only imagine how we already get spammed and you imagine and all of a sudden we can do heavy attacks, juice. I don&#8217;t even want to<\/p>\n<p>00:43:06<br \/>\n<strong>Owen Moon:<\/strong> oh, and argue all the time, because of course, in order to get something ordered on your phone, they make you, you know, opt-in. And so next thing you know, I mean, I&#8217;m getting them all day long now. It&#8217;s like, Oh, this guy sends me another offer. And, you know, especially in e-com. I mean, it&#8217;s an aggressive world right now. People are just trying to put more stuff in front of consumers and suppose that they figure you bought something once you&#8217;re the most likely candidate to buy a second item and you know the ones I like, I keep the ones I, you know, maybe bought a one-off thing on. I opt out pretty quickly and I think that&#8217;s what you&#8217;ll see. You know, from a dealership standpoint, if you&#8217;re not providing value in any communication channel, people are going to opt-out, whether it&#8217;s email, text message, that type of thing. We use dealer wallet. That&#8217;s a piece of software that we developed that allows customers to drop their passes or their coupons, per se their offers into their Apple Wallet. And that&#8217;s been great for us because again, it&#8217;s kind of meeting their customer. Yet in an environment that they&#8217;re used to, they&#8217;re used to using their Apple Wallet for airline tickets and hotels and concert tickets. I actually download them. I&#8217;m a don&#8217;t hold this against me. I&#8217;m a Viking season ticket holder and the first couple of times I show up with my tickets, they were in my Vikings app. Well, guess what you got? You&#8217;re sixty thousand people showing up to the, you know, the stadium. Guess what&#8217;s not getting used very well? Internet people can&#8217;t download anything. Things are getting jammed up. So I got smart and said, You know what? I&#8217;m going to start to download them into my Apple Wallet now. They&#8217;re just sitting there, and when I pop in, I show them that they scan it. I&#8217;m in the game. It takes me two seconds and you know, it&#8217;s in, but you live and you learn. And that&#8217;s, you know, I think that having the ability for people to use their phones to save information is huge. And I think is going to be, you know, a part of that, that driver in the future.<\/p>\n<p>00:44:58<br \/>\n<strong>Herb Anderson:<\/strong> So for sure, man, do thank you so much for doing this. Loved having you back. Really good conversation. I really enjoyed it, man. I&#8217;m excited about your guys&#8217; future. It&#8217;s great again to see your growth, obviously, as we continue to evolve and. Industry, we&#8217;re going to need more and more opportunities to kind of showcase fixed operations, right? And I think you guys are doing a fantastic job in helping dealers do that. There is one question that I ask everybody that comes on the show and that question is where do you see the automotive industry headed in the next five years and why?<\/p>\n<p>00:45:36<br \/>\n<strong>Owen Moon:<\/strong> Well, I think the next five years, I think I actually answer this question. Maybe when you have me on the first time, maybe the same answer.<\/p>\n<p>00:45:44<br \/>\n<strong>Herb Anderson:<\/strong> So you did. You did. But it was a big stops question because that&#8217;s the episode. So is the first time we&#8217;re actually answering this version of it.<\/p>\n<p>00:45:55<br \/>\n<strong>Owen Moon:<\/strong> Well, and some of it&#8217;s positive, and I think some of it&#8217;s negative. I&#8217;ll tell you this. I think from an OEM standpoint, they are going to continue to try to control the environment by selling new cars. And unfortunately, that leaves the dealership with used cars and fixed ups as the two pillars or two revenue streams that they can control. If you look at specifically from fixed ops, I think you&#8217;re going to get into a lot more electric vehicles and, you know, energy-efficient vehicles and things like that. And in fact, we&#8217;ve already had some of our dealerships start to provide us with some info for some of their electric cars when it comes to service and putting those offers out on their website and that type of thing. So I would say that that would be, you know, from if you look at from an industry standpoint, OEMs and the new car side are still continuing to be an ever-changing environment. And then from a fixed-up standpoint, just getting into more of those electric vehicles, and that&#8217;s going to change the game when it comes to service. Obviously, there&#8217;s going to be a lot of different types of services that are dealerships going to have to, you know, kind of for a while they&#8217;re going to do both right there and have a lot of, you know, gas-powered cars and the kind of the cars that we&#8217;re seeing today. And then they&#8217;re also going to have to service. Those are those new, those new cars that are coming that are, you know, electric and energy-efficient, that type of thing. So that&#8217;s kind of where I see things are going. And obviously, you know, it&#8217;s always going to be an exciting time in the automotive automotive industry, right?<\/p>\n<p>00:47:21<br \/>\n<strong>Herb Anderson:<\/strong> So yes, sir, definitely. As you know, obviously, this industry is so fast-paced these days that it&#8217;s been hard to catch up, man, but listen to it again. Thank you so much for tuning in or coming to the show. We really appreciate it, man. Lots of good information again. Always love having conversations with you. Say hello to your teams, hail or cab. And for me, that&#8217;s all the time that we have for today, folks. And as usual, we&#8217;ll talk later.[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221;&#8230;<\/p>\n","protected":false},"author":3,"featured_media":7956,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[161,160,54],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Owen Moon on Dealer Talk Podcast - Fixed Ops Digital<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Owen Moon on Dealer Talk Podcast - Fixed Ops Digital\" \/>\n<meta property=\"og:description\" content=\"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221;...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/\" \/>\n<meta property=\"og:site_name\" content=\"Fixed Ops Digital\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/fixedopsdigital\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-10-18T18:27:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1125\" \/>\n\t<meta property=\"og:image:height\" content=\"750\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Julie Branum\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"41 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\",\"name\":\"Fixed Ops Digital\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/fixedopsdigital\/\",\"https:\/\/www.instagram.com\/fixedops\/\",\"https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png\",\"width\":750,\"height\":200,\"caption\":\"Fixed Ops Digital\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\",\"url\":\"https:\/\/www.fixedopsdigital.com\/\",\"name\":\"Fixed Ops Digital Marketing\",\"description\":\"Automotive Fixed Ops Marketing\",\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg\",\"contentUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg\",\"width\":1125,\"height\":750,\"caption\":\"Dealer Talk Podcast with Owen Moon as a Guest\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage\",\"url\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/\",\"name\":\"Owen Moon on Dealer Talk Podcast - Fixed Ops Digital\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage\"},\"datePublished\":\"2021-10-18T18:27:29+00:00\",\"dateModified\":\"2021-10-18T18:27:29+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.fixedopsdigital.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Owen Moon on Dealer Talk Podcast\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage\"},\"author\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\"},\"headline\":\"Owen Moon on Dealer Talk Podcast\",\"datePublished\":\"2021-10-18T18:27:29+00:00\",\"dateModified\":\"2021-10-18T18:27:29+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage\"},\"wordCount\":9395,\"publisher\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg\",\"keywords\":[\"Dealer Talk Podcast\",\"Herb Anderson\",\"Owen Moon\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941\",\"name\":\"Julie Branum\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.fixedopsdigital.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g\",\"caption\":\"Julie Branum\"},\"description\":\"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.\",\"url\":\"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Owen Moon on Dealer Talk Podcast - Fixed Ops Digital","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/","og_locale":"en_US","og_type":"article","og_title":"Owen Moon on Dealer Talk Podcast - Fixed Ops Digital","og_description":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221;...","og_url":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/","og_site_name":"Fixed Ops Digital","article_publisher":"https:\/\/www.facebook.com\/fixedopsdigital\/","article_published_time":"2021-10-18T18:27:29+00:00","og_image":[{"width":1125,"height":750,"url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Julie Branum","Est. reading time":"41 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/www.fixedopsdigital.com\/#organization","name":"Fixed Ops Digital","url":"https:\/\/www.fixedopsdigital.com\/","sameAs":["https:\/\/www.facebook.com\/fixedopsdigital\/","https:\/\/www.instagram.com\/fixedops\/","https:\/\/www.linkedin.com\/company\/fixed-ops-digital\/"],"logo":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#logo","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2018\/05\/FixedOpsDigital.png","width":750,"height":200,"caption":"Fixed Ops Digital"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/www.fixedopsdigital.com\/#website","url":"https:\/\/www.fixedopsdigital.com\/","name":"Fixed Ops Digital Marketing","description":"Automotive Fixed Ops Marketing","publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.fixedopsdigital.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg","contentUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg","width":1125,"height":750,"caption":"Dealer Talk Podcast with Owen Moon as a Guest"},{"@type":"WebPage","@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage","url":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/","name":"Owen Moon on Dealer Talk Podcast - Fixed Ops Digital","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage"},"datePublished":"2021-10-18T18:27:29+00:00","dateModified":"2021-10-18T18:27:29+00:00","breadcrumb":{"@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.fixedopsdigital.com\/"},{"@type":"ListItem","position":2,"name":"Owen Moon on Dealer Talk Podcast"}]},{"@type":"Article","@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#article","isPartOf":{"@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage"},"author":{"@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941"},"headline":"Owen Moon on Dealer Talk Podcast","datePublished":"2021-10-18T18:27:29+00:00","dateModified":"2021-10-18T18:27:29+00:00","mainEntityOfPage":{"@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#webpage"},"wordCount":9395,"publisher":{"@id":"https:\/\/www.fixedopsdigital.com\/#organization"},"image":{"@id":"https:\/\/www.fixedopsdigital.com\/owen-moon-on-dealer-talk-podcast\/#primaryimage"},"thumbnailUrl":"https:\/\/www.fixedopsdigital.com\/wp-content\/uploads\/2021\/10\/FOD-2021-DealerTalk-FEATURE.jpg","keywords":["Dealer Talk Podcast","Herb Anderson","Owen Moon"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.fixedopsdigital.com\/#\/schema\/person\/3c37afa147ab605f341be17ea0db0941","name":"Julie Branum","image":{"@type":"ImageObject","@id":"https:\/\/www.fixedopsdigital.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/928f2353c8b72c9ae5d94e9a62381307?s=96&d=mm&r=g","caption":"Julie Branum"},"description":"Julie has a decade of experience in the car business and marketing specifically for manufacturer dealerships in the U.S. Utilizing best practices and her background in design, Julie believes in presenting and converting dealerships online visitors into high RO Service and Parts Department customers.","url":"https:\/\/www.fixedopsdigital.com\/author\/dssjulie\/"}]}},"_links":{"self":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7955"}],"collection":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/comments?post=7955"}],"version-history":[{"count":0,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/posts\/7955\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media\/7956"}],"wp:attachment":[{"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/media?parent=7955"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/categories?post=7955"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fixedopsdigital.com\/wp-json\/wp\/v2\/tags?post=7955"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}